# YOLO11n + VAFEM-P3P4
# For infrared chimney-like / column-like object detection
# Only add VAFEM before P3 and P4 detection outputs

nc: 2

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]     # 2

  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 6, C3k2, [512, False, 0.25]]     # 4-P3

  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 6, C3k2, [512, True]]            # 6-P4

  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10-P5

head:
  # -------------------------
  # Top-down: P5 -> P4
  # -------------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12
  - [-1, 3, C3k2, [512, False]]                  # 13 P4_td

  # -------------------------
  # Top-down: P4 -> P3
  # -------------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 3, C3k2, [256, False]]                  # 16 P3_out
  - [-1, 1, VAFEM, [256, 0.5, 9, 5, 32]]          # 17 P3_out enhanced

  # -------------------------
  # Bottom-up: P3 -> P4
  # -------------------------
  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19
  - [-1, 3, C3k2, [512, False]]                  # 20 P4_out
  - [-1, 1, VAFEM, [512, 0.5, 9, 5, 32]]          # 21 P4_out enhanced

  # -------------------------
  # Bottom-up: P4 -> P5
  # -------------------------
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 10], 1, Concat, [1]]                   # 23
  - [-1, 3, C3k2, [1024, True]]                  # 24 P5_out

  # -------------------------
  # Detect
  # -------------------------
  - [[17, 21, 24], 1, Detect, [nc]]              # Detect(P3, P4, P5)