# YOLO11-VAM-ConvDown-Neck
# Backbone: YOLO11 original modules
# Neck: VAM enhancement + Conv downsample
# Detect: P3, P4, P5

nc: 2

scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]    # 2

  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 6, C3k2, [512, False, 0.25]]    # 4-P3

  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 6, C3k2, [512, True]]           # 6-P4

  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10-P5

head:
  # ------------------------------------------------
  # P3 / P4 / P5 from backbone
  # 4  = P3/8
  # 6  = P4/16
  # 10 = P5/32 after C2PSA
  # ------------------------------------------------

  # ------------------------------------------------
  # 1. VAM enhancement + Conv downsample paths
  # 原来是 VAM(s=2) 直接下采样
  # 现在改成 VAM(s=1) 增强特征，再用 Conv(s=2) 下采样
  # ------------------------------------------------

  - [4, 1, VAM, [512, 1]]                         # 11 P3 VAM, keep P3/8
  - [-1, 1, Conv, [512, 3, 2]]                    # 12 P3_vam -> P4/16

  - [6, 1, VAM, [1024, 1]]                        # 13 P4 VAM, keep P4/16
  - [-1, 1, Conv, [1024, 3, 2]]                   # 14 P4_vam -> P5/32

  # ------------------------------------------------
  # 2. Bottom P5 fusion
  # P5 + Conv(VAM(P4))
  # ------------------------------------------------

  - [[10, 14], 1, Concat, [1]]                    # 15 P5 concat
  - [15, 3, C3k2, [1024, True]]                   # 16 P5_td

  # ------------------------------------------------
  # 3. Top-down P4 fusion
  # P4 + Conv(VAM(P3)) + Up(P5_td)
  # ------------------------------------------------

  - [16, 1, nn.Upsample, [None, 2, "nearest"]]    # 17 P5_td -> P4
  - [[6, 12, 17], 1, Concat, [1]]                 # 18 P4 concat
  - [18, 3, C3k2, [512, True]]                    # 19 P4_td

  # ------------------------------------------------
  # 4. Top-down P3 fusion
  # P3 + Up(P4_td)
  # ------------------------------------------------

  - [19, 1, nn.Upsample, [None, 2, "nearest"]]    # 20 P4_td -> P3
  - [[4, 20], 1, Concat, [1]]                     # 21 P3 concat
  - [21, 3, C3k2, [256, True]]                    # 22 P3_out

  # ------------------------------------------------
  # 5. Bottom-up P4 fusion
  # Down(P3_out) + P4_td
  # ------------------------------------------------

  - [22, 1, Conv, [256, 3, 2]]                    # 23 P3_out -> P4
  - [[19, 23], 1, Concat, [1]]                    # 24 P4 concat
  - [24, 3, C3k2, [512, True]]                    # 25 P4_out

  # ------------------------------------------------
  # 6. Extra VAM path
  # P4_td -> VAM(s=1) -> Conv(s=2) -> P5
  # 原来是 VAM(s=2) 直接下采样
  # ------------------------------------------------

  - [19, 1, VAM, [1024, 1]]                       # 26 P4_td VAM, keep P4/16
  - [-1, 1, Conv, [1024, 3, 2]]                   # 27 P4_td_vam -> P5/32

  # ------------------------------------------------
  # 7. Bottom-up P5 fusion
  # P5_td + Conv(VAM(P4_td)) + Down(P4_out)
  # ------------------------------------------------

  - [25, 1, Conv, [512, 3, 2]]                    # 28 P4_out -> P5
  - [[16, 27, 28], 1, Concat, [1]]                # 29 P5 concat
  - [29, 3, C3k2, [1024, True]]                   # 30 P5_out

  # ------------------------------------------------
  # 8. Detect
  # ------------------------------------------------

  - [[22, 25, 30], 1, Detect, [nc]]               # 31 Detect(P3, P4, P5)