# YOLO11-DPGM-VAM-BiFPN-C3k2
# Backbone: replace C3k2 with DPGM
# Neck: VAM + BiFPN-style fusion, replace DPGM with C3k2
# Detect: P3, P4, P5

nc: 2

scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4

  # C3k2 -> DPGM
  - [-1, 3, DPGM, [256, 0.5, 5, 0.5, False]]   # 2

  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8

  # C3k2 -> DPGM
  - [-1, 6, DPGM, [512, 0.5, 5, 0.5, False]]   # 4-P3

  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16

  # C3k2 -> DPGM
  - [-1, 6, DPGM, [512, 0.5, 7, 0.5, True]]    # 6-P4

  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32

  # C3k2 -> DPGM
  - [-1, 3, DPGM, [1024, 0.5, 9, 0.5, True]]   # 8

  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10-P5


head:
  # ------------------------------------------------
  # P3 / P4 / P5 from backbone
  # 4  = P3/8
  # 6  = P4/16
  # 10 = P5/32 after C2PSA
  # ------------------------------------------------

  # ------------------------------------------------
  # 1. VAM downsample paths
  # ------------------------------------------------
  - [4, 1, VAM, [512, 2]]                      # 11 P3 -> P4
  - [6, 1, VAM, [1024, 2]]                     # 12 P4 -> P5

  # ------------------------------------------------
  # 2. Bottom P5 fusion
  # P5 + VAM(P4)
  # ------------------------------------------------
  - [[10, 12], 1, Concat, [1]]                 # 13 P5 concat

  # DPGM -> C3k2
  - [13, 3, C3k2, [1024, True]]                # 14 P5_td

  # ------------------------------------------------
  # 3. Top-down P4 fusion
  # P4 + VAM(P3) + Up(P5_td)
  # ------------------------------------------------
  - [14, 1, nn.Upsample, [None, 2, "nearest"]] # 15 P5_td -> P4
  - [[6, 11, 15], 1, Concat, [1]]              # 16 P4 concat

  # DPGM -> C3k2
  - [16, 3, C3k2, [512, True]]                 # 17 P4_td

  # ------------------------------------------------
  # 4. Top-down P3 fusion
  # P3 + Up(P4_td)
  # ------------------------------------------------
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 18 P4_td -> P3
  - [[4, 18], 1, Concat, [1]]                  # 19 P3 concat

  # DPGM -> C3k2
  - [19, 3, C3k2, [256, True]]                 # 20 P3_out

  # ------------------------------------------------
  # 5. Bottom-up P4 fusion
  # Down(P3_out) + P4_td
  # ------------------------------------------------
  - [20, 1, Conv, [256, 3, 2]]                 # 21 P3_out -> P4
  - [[17, 21], 1, Concat, [1]]                 # 22 P4 concat

  # DPGM -> C3k2
  - [22, 3, C3k2, [512, True]]                 # 23 P4_out

  # ------------------------------------------------
  # 6. Extra VAM path
  # P4_td -> P5
  # ------------------------------------------------
  - [17, 1, VAM, [1024, 2]]                    # 24 P4_td -> P5

  # ------------------------------------------------
  # 7. Bottom-up P5 fusion
  # VAM(P5_backbone) + VAM(P4_td) + Down(P4_out)
  # ------------------------------------------------
  - [23, 1, Conv, [512, 3, 2]]                 # 25 P4_out -> P5
  - [10, 1, VAM, [1024, 1]]                    # 26 P5 backbone -> VAM, keep P5/32

  - [[26, 24, 25], 1, Concat, [1]]             # 27 P5 concat

  # DPGM -> C3k2
  - [27, 3, C3k2, [1024, True]]                # 28 P5_out

  # ------------------------------------------------
  # 8. Detect
  # ------------------------------------------------
  - [[20, 23, 28], 1, Detect, [nc]]            # 29 Detect(P3, P4, P5)