
# Backbone: YOLO11 original modules
# Neck: VAM + BiFPN weighted fusion + DPGM
# Detect: P3, P4, P5

nc: 2

scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]    # 2

  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 6, C3k2, [512, False, 0.25]]    # 4-P3

  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 6, C3k2, [512, True]]           # 6-P4

  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, MSLKAConv, [1024]]               # 10-P5


head:
  # ------------------------------------------------
  # P2 / P3 / P4 / P5 from backbone
  # 2  = P2/4
  # 4  = P3/8
  # 6  = P4/16
  # 10 = P5/32 after MSLKAConv
  # ------------------------------------------------

  # ------------------------------------------------
  # 1. VAM downsample paths
  # P3 -> P4, P4 -> P5
  # ------------------------------------------------
  - [4, 1, VAM, [512, 2]]                         # 11 P3 -> P4
  - [6, 1, VAM, [1024, 2]]                        # 12 P4 -> P5

  # ------------------------------------------------
  # 2. Bottom P5 fusion
  # P5_backbone + VAM(P4)
  # ------------------------------------------------
  - [[10, 12], 1, Concat, [1]]                    # 13 P5 concat
  - [13, 3, DPGM, [1024, 0.5, 9, 0.5, True]]      # 14 P5_td

  # ------------------------------------------------
  # 3. Top-down P4 fusion
  # P4_backbone + VAM(P3) + Up(P5_td)
  # ------------------------------------------------
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]    # 15 P5_td -> P4
  - [[6, 11, 15], 1, Concat, [1]]                 # 16 P4 concat
  - [16, 3, DPGM, [512, 0.5, 7, 0.5, True]]       # 17 P4_td

  # ------------------------------------------------
  # 4. Top-down P3 fusion
  # P3_backbone + Up(P4_td)
  # ------------------------------------------------
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]    # 18 P4_td -> P3
  - [[4, 18], 1, Concat, [1]]                     # 19 P3 concat
  - [19, 3, DPGM, [256, 0.5, 5, 0.5, True]]       # 20 P3_td

  # ------------------------------------------------
  # 5. New Top-down P2 fusion
  # P2_backbone + Up(P3_td)
  # ------------------------------------------------
  - [20, 1, nn.Upsample, [None, 2, "nearest"]]    # 21 P3_td -> P2
  - [[2, 21], 1, Concat, [1]]                     # 22 P2 concat
  - [22, 2, C3k2, [256, False, 0.25]]             # 23 P2_out

  # ------------------------------------------------
  # 6. Bottom-up P3 fusion
  # Down(P2_out) + P3_td
  # ------------------------------------------------
  - [23, 1, Conv, [256, 3, 2]]                    # 24 P2_out -> P3
  - [[20, 24], 1, Concat, [1]]                    # 25 P3 concat
  - [25, 3, DPGM, [256, 0.5, 5, 0.5, True]]       # 26 P3_out

  # ------------------------------------------------
  # 7. Bottom-up P4 fusion
  # Down(P3_out) + P4_td
  # ------------------------------------------------
  - [26, 1, Conv, [256, 3, 2]]                    # 27 P3_out -> P4
  - [[17, 27], 1, Concat, [1]]                    # 28 P4 concat
  - [28, 3, DPGM, [512, 0.5, 7, 0.5, True]]       # 29 P4_out

  # ------------------------------------------------
  # 8. Bottom-up P5 fusion
  # VAM(P5_backbone) + Down(P4_td) + Down(P4_out)
  # ------------------------------------------------
  - [17, 1, Conv, [1024, 3, 2]]                   # 30 P4_td -> P5
  - [29, 1, Conv, [512, 3, 2]]                    # 31 P4_out -> P5
  - [10, 1, VAM, [1024, 1]]                       # 32 P5_backbone -> VAM

  - [[32, 30, 31], 1, Concat, [1]]                # 33 P5 concat
  - [33, 3, DPGM, [1024, 0.5, 9, 0.5, True]]      # 34 P5_out

  # ------------------------------------------------
  # 9. Detect
  # Four-scale detection: P2, P3, P4, P5
  # ------------------------------------------------
  - [[23, 26, 29, 34], 1, Detect, [nc]]           # 35 Detect(P2, P3, P4, P5)