# YOLO11-VAM-BiFPN
# Backbone: YOLO11 original modules
# Neck: VAM + BiFPN weighted fusion
# Detect: P3, P4, P5

nc: 2

scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]    # 2

  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 6, C3k2, [512, False, 0.25]]    # 4-P3

  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 6, C3k2, [512, True]]           # 6-P4

  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10-P5


head:
  # ------------------------------------------------
  # P3 / P4 / P5 from backbone
  # 4  = P3/8
  # 6  = P4/16
  # 10 = P5/32 after C2PSA
  # ------------------------------------------------

  # ------------------------------------------------
  # 1. Ordinary Conv downsample paths
  # VAM(s=2) -> ordinary Conv downsample
  # ------------------------------------------------
  - [4, 1, Conv, [512, 3, 2]]                     # 11 P3 -> P4, replace VAM(s=2)
  - [6, 1, Conv, [1024, 3, 2]]                    # 12 P4 -> P5, replace VAM(s=2)

  # ------------------------------------------------
  # 2. Bottom P5 fusion
  # P5 + Down(P4)
  # ------------------------------------------------
  - [[10, 12], 1, Concat, [1]]                    # 13 P5 concat
  - [13, 3, C3k2, [1024, True]]                   # 14 P5_td

  # ------------------------------------------------
  # 3. Top-down P4 fusion
  # P4 + Down(P3) + Up(P5_td)
  # ------------------------------------------------
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]    # 15 P5_td -> P4
  - [[6, 11, 15], 1, Concat, [1]]                 # 16 P4 concat
  - [16, 3, C3k2, [512, True]]                    # 17 P4_td

  # ------------------------------------------------
  # 4. Top-down P3 fusion
  # P3 + Up(P4_td)
  # ------------------------------------------------
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]    # 18 P4_td -> P3
  - [[4, 18], 1, Concat, [1]]                     # 19 P3 concat
  - [19, 3, C3k2, [256, True]]                    # 20 P3_out

  # ------------------------------------------------
  # 5. Bottom-up P4 fusion
  # Down(P3_out) + P4_td
  # ------------------------------------------------
  - [20, 1, Conv, [256, 3, 2]]                    # 21 P3_out -> P4
  - [[17, 21], 1, Concat, [1]]                    # 22 P4 concat
  - [22, 3, C3k2, [512, True]]                    # 23 P4_out

  # ------------------------------------------------
  # 6. Bottom-up P5 path
  # P4_td -> P5
  # ------------------------------------------------
  - [17, 1, Conv, [1024, 3, 2]]                   # 24 P4_td -> P5

  # ------------------------------------------------
  # 7. Bottom-up P5 fusion
  # Remove VAM(s=1) directly
  # 原来是 VAM(P5_backbone)(26) + Down(P4_td)(24) + Down(P4_out)(25)
  # 现在是 P5_backbone(10) + Down(P4_td)(24) + Down(P4_out)(25)
  # ------------------------------------------------
  - [23, 1, Conv, [512, 3, 2]]                    # 25 P4_out -> P5

  - [[10, 24, 25], 1, Concat, [1]]                # 26 P5 concat, remove VAM(s=1)
  - [26, 3, C3k2, [1024, True]]                   # 27 P5_out

  # ------------------------------------------------
  # 8. Detect
  # ------------------------------------------------
  - [[20, 23, 27], 1, Detect, [nc]]               # 28 Detect(P3, P4, P5)