# YOLO11-VAM-BiFPN
# Backbone: YOLO11 original modules
# Neck: VAM + BiFPN weighted fusion
# Detect: P3, P4, P5

nc: 2

scales:
  n: [0.50, 0.25, 1024]


# YOLO11-C3K2-VAM-BiFPN
# neck start: P3/P4/P5 all projected to 256 channels
# BiFPN_Concat replaces Concat

backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]    # 2

  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 6, C3k2, [512, False, 0.25]]    # 4-P3

  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 6, C3k2, [512, True]]           # 6-P4

  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10-P5


head:
  # -------------------------
  # 1. Channel Alignment
  # -------------------------
  - [4, 1, Conv, [256, 1, 1]]                     # 11 P3_in, 1/8
  - [6, 1, Conv, [256, 1, 1]]                     # 12 P4_in, 1/16
  - [10, 1, Conv, [256, 1, 1]]                    # 13 P5_in, 1/32

  # -------------------------
  # 2. VAM Downsample Shortcuts
  # -------------------------
  - [11, 1, VAM, [256, 2]]                        # 14 P3 -> P4 by VAM, 1/8 -> 1/16
  - [12, 1, VAM, [256, 2]]                        # 15 P4 -> P5 by VAM, 1/16 -> 1/32

  # -------------------------
  # 3. Bottom Feature Fusion: P5
  # P5_in + VAM(P4)
  # -------------------------
  - [[13, 15], 1, BiFPN_Concat, []]               # 16 P5 fusion
  - [16, 3, C3k2, [256, True]]                    # 17 P5_td

  # -------------------------
  # 4. Top-down Fusion: P4
  # P4_in + VAM(P3) + Up(P5_td)
  # -------------------------
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]    # 18 P5_td -> P4
  - [[12, 14, 18], 1, BiFPN_Concat, []]           # 19 P4 fusion
  - [19, 3, C3k2, [256, True]]                    # 20 P4_td

  # -------------------------
  # 5. Top-down Fusion: P3
  # P3_in + Up(P4_td)
  # -------------------------
  - [20, 1, nn.Upsample, [None, 2, "nearest"]]    # 21 P4_td -> P3
  - [[11, 21], 1, BiFPN_Concat, []]               # 22 P3 fusion
  - [22, 3, C3k2, [256, True]]                    # 23 P3_out

  # -------------------------
  # 6. Bottom-up Fusion: P4
  # Down(P3_out) + P4_td
  # -------------------------
  - [23, 1, Conv, [256, 3, 2]]                    # 24 P3_out -> P4
  - [[20, 24], 1, BiFPN_Concat, []]               # 25 P4_out fusion
  - [25, 3, C3k2, [256, True]]                    # 26 P4_out

  # -------------------------
  # 7. Extra VAM path: P4_td -> P5
  # 对应图中中间偏右的 VAM
  # -------------------------
  - [20, 1, VAM, [256, 2]]                        # 27 P4_td -> P5 by VAM

  # -------------------------
  # 8. Bottom-up Fusion: P5
  # P5_td + VAM(P4_td) + Down(P4_out)
  # -------------------------
  - [26, 1, Conv, [256, 3, 2]]                    # 28 P4_out -> P5
  - [[17, 27, 28], 1, BiFPN_Concat, []]           # 29 P5_out fusion

  # -------------------------
  # 9. Detect
  # -------------------------
  - [[23, 26, 29], 1, Detect, [nc]]               # 31 Detect(P3, P4, P5)